sujet 0 - 2021 - ex4

In [1]:
%load_ext sql
%sql sqlite://

In [ ]:
%%sql
DROP TABLE IF EXISTS EMPLOYEE;
CREATE TABLE EMPLOYEE(firstname varchar(50),lastname varchar(50));
INSERT INTO EMPLOYEE VALUES('Tom','Pascal');
INSERT INTO EMPLOYEE VALUES('Jack','Ryan');

In [ ]:
 %sql SELECT * from EMPLOYEE;

In [ ]:
%sql SELECT * from EMPLOYEE;

L’énoncé de cet exercice utilise les mots du langage SQL suivant :

    SELECT, FROM, WHERE, JOIN, INSERT INTO, VALUES, COUNT, ORDER BY.
    
Dans un lycée imaginaire, les données relatives aux élèves de secondes sont regroupées dans un fichier nommé
`seconde_lyc.csv`. Un extrait de son contenu est représenté figure 1.

![](./img-enonce01.png)

*Extrait du fichier `seconde_lyc.csv`*

![](https://raw.githubusercontent.com/padilla-nsi/tnsi/main/cours/bases-de-donnees/3-requetesEtMiseAJour/img-enonce01.png)

*Extrait du fichier `seconde_lyc.csv`*

Pour les besoins de l’organisation du lycée, le chef d’établissement exploite la base de données par des requêtes en langage `SQL`. Il a pour cela créé une table (ou *relation*) SQL dénommée `seconde` dans son système de
gestion de bases de données dont la structure est la suivante :

![](./img-enonce02.png)

In [121]:
%%sql
PRAGMA foreign_keys=ON;
DROP TABLE IF EXISTS eleve;
CREATE TABLE eleve (
    num_eleve INT,
    nom CHAR(20),
    prenom CHAR(20),
    datenaissance DATE,
    PRIMARY KEY(num_eleve));

INSERT INTO eleve VALUES
    (133310, 'ACHIR', 'Mussa', '2005-01-01'),
    (500633, 'BELEY', 'Thibaut', '2005-05-05'),
    (911887, 'BELEY', 'Marie', '2005-05-05'),
    (057934, 'GROSJEAN', 'Alexandre', '2005-11-09'),
    (024810, 'JULIANO', 'Alberto', '2005-04-21'),
    (249992, 'KLEIBER', 'Gusti', '2005-02-20'),
    (076725, 'MARTIN', 'Victor', '2005-03-13'),
    (815183, 'NGUYEN', 'Ngong', '2005-03-16'),
    (321262, 'RENAULT', 'Zoé', '2005-08-06'),
    (108303, 'GEHIN', 'Arthur', '2005-02-26'),
    (571113, 'HENRY', 'Paul', '2005-03-12'),
    (094002, 'PELTIER', 'Romane', '2005-06-14'),
    (156929, 'ALTMEYER', 'Yohan', '2005-05-05'),
    (90689, 'BELEY', 'Manon', '2005-01-10'),
    (081282, 'EISEN', 'Carla', '2004-06-23'),
    (075421, 'ROTH', 'Ursule', '2005-01-03'),
    (488697, 'CAILLE', 'Marie', '2004-03-30'),
    (492698, 'LACOUR', 'Julie', '2005-04-06'),
    (121001, 'SERHANI', 'Sabrina', '2005-09-01'),
    (193514, 'CHARPENTIER', 'Jules', '2005-12-25'),
    (321188, 'CLAUDEL', 'Benjamin', '2005-09-09'),
    (026454, 'LARBI', 'Nourdine', '2005-07-14'),
    (309341, 'LEFZA', 'Yasmina', '2005-11-26'),
    (488820, 'JACQUET', 'Marc', '2005-11-13'),
    (026946, 'ELAYAR', 'Amir', '2005-09-11');
    
    
SELECT * FROM eleve
ORDER BY nom ASC;

 * sqlite://
Done.
Done.
Done.
25 rows affected.
Done.

[(133310, 'ACHIR', 'Mussa', '2005-01-01'),
 (156929, 'ALTMEYER', 'Yohan', '2005-05-05'),
 (500633, 'BELEY', 'Thibaut', '2005-05-05'),
 (911887, 'BELEY', 'Marie', '2005-05-05'),
 (90689, 'BELEY', 'Manon', '2005-01-10'),
 (488697, 'CAILLE', 'Marie', '2004-03-30'),
 (193514, 'CHARPENTIER', 'Jules', '2005-12-25'),
 (321188, 'CLAUDEL', 'Benjamin', '2005-09-09'),
 (81282, 'EISEN', 'Carla', '2004-06-23'),
 (26946, 'ELAYAR', 'Amir', '2005-09-11'),
 (108303, 'GEHIN', 'Arthur', '2005-02-26'),
 (57934, 'GROSJEAN', 'Alexandre', '2005-11-09'),
 (571113, 'HENRY', 'Paul', '2005-03-12'),
 (488820, 'JACQUET', 'Marc', '2005-11-13'),
 (24810, 'JULIANO', 'Alberto', '2005-04-21'),
 (249992, 'KLEIBER', 'Gusti', '2005-02-20'),
 (492698, 'LACOUR', 'Julie', '2005-04-06'),
 (26454, 'LARBI', 'Nourdine', '2005-07-14'),
 (309341, 'LEFZA', 'Yasmina', '2005-11-26'),
 (76725, 'MARTIN', 'Victor', '2005-03-13'),
 (815183, 'NGUYEN', 'Ngong', '2005-03-16'),
 (94002, 'PELTIER', 'Romane', '2005-06-14'),
 (321262, 'RENAULT', 'Zoé', '2005-08-06'),
 (75421, 'ROTH', 'Ursule', '2005-01-03'),
 (121001, 'SERHANI', 'Sabrina', '2005-09-01')]

In [122]:
%%sql

DROP TABLE IF EXISTS seconde;
CREATE TABLE seconde(
    num_eleve INTEGER PRIMARY KEY,
    langue1 CHAR(20),
    langue2 CHAR(20),
    option CHAR(20),
    classe CHAR(20),
    FOREIGN KEY(num_eleve) REFERENCES eleve(num_eleve));

INSERT INTO seconde VALUES
    (133310, 'anglais', 'espagnol', '', '2A'),
    (500633, 'anglais', 'espagnol', '', '2A'),
    (911887, 'anglais', 'espagnol', '', '2A'),
    (057934, 'anglais', 'espagnol', '', '2C'),
    (024810, 'anglais', 'espagnol', '', '2C'),
    (249992, 'anglais', 'espagnol', 'cinéma', '2E'),
    (076725, 'anglais', 'espagnol', '', '2A'),
    (815183, 'anglais', 'espagnol', '', '2D'),
    (321262, 'anglais', 'espagnol', 'latin', '2E'),
    (108303, 'allemand', 'anglais', 'théâtre', '2D'),
    (571113, 'allemand', 'anglais', '', '2D'),
    (094002, 'allemand', 'anglais', '', '2D'),
    (156929, 'ERREUR DE SAISIE', 'anglais', '', '2D'),
    (90689, 'anglais', 'allemand', '', '2E'),
    (081282, 'anglais', 'allemand', '', '2A'),
    (075421, 'anglais', 'allemand', '', '2A'),
    (488697, 'italien', 'anglais', '', '2D'),
    (492698, 'italien', 'anglais', '', '2D'),
    (121001, 'italien', 'anglais', '', '2D'),
    (193514, 'espagnol', 'anglais', '', '2C'),
    (321188, 'espagnol', 'anglais', '', '2C'),
    (026454, 'espagnol', 'anglais', '', '2C'),
    (309341, 'espagnol', 'anglais', '', '2C'),
    (026946, 'anglais', 'arabe', 'cinéma', '2D');
    
SELECT * FROM seconde;

 * sqlite://
Done.
Done.
24 rows affected.
Done.

[(24810, 'anglais', 'espagnol', '', '2C'),
 (26454, 'espagnol', 'anglais', '', '2C'),
 (26946, 'anglais', 'arabe', 'cinéma', '2D'),
 (57934, 'anglais', 'espagnol', '', '2C'),
 (75421, 'anglais', 'allemand', '', '2A'),
 (76725, 'anglais', 'espagnol', '', '2A'),
 (81282, 'anglais', 'allemand', '', '2A'),
 (90689, 'anglais', 'allemand', '', '2E'),
 (94002, 'allemand', 'anglais', '', '2D'),
 (108303, 'allemand', 'anglais', 'théâtre', '2D'),
 (121001, 'italien', 'anglais', '', '2D'),
 (133310, 'anglais', 'espagnol', '', '2A'),
 (156929, 'ERREUR DE SAISIE', 'anglais', '', '2D'),
 (193514, 'espagnol', 'anglais', '', '2C'),
 (249992, 'anglais', 'espagnol', 'cinéma', '2E'),
 (309341, 'espagnol', 'anglais', '', '2C'),
 (321188, 'espagnol', 'anglais', '', '2C'),
 (321262, 'anglais', 'espagnol', 'latin', '2E'),
 (488697, 'italien', 'anglais', '', '2D'),
 (492698, 'italien', 'anglais', '', '2D'),
 (500633, 'anglais', 'espagnol', '', '2A'),
 (571113, 'allemand', 'anglais', '', '2D'),
 (815183, 'anglais', 'espagnol', '', '2D'),
 (911887, 'anglais', 'espagnol', '', '2A')]

In [38]:
%%sql

UPDATE seconde
    SET langue1 = 'allemand'
    WHERE num_eleve=156929;

SELECT * FROM seconde
WHERE num_eleve = 156929;

 * sqlite://
1 rows affected.
Done.

[(156929, 'allemand', 'anglais', '', '2D')]

![](https://raw.githubusercontent.com/padilla-nsi/tnsi/main/cours/bases-de-donnees/3-requetesEtMiseAJour/img-enonce02.png)

L’attribut `num_eleve` est un entier, les autres sont des chaines de caractère (le type `CHAR`).

## Question 1

### 1.1. 

Dans le modèle relationnel, quel est l’intérêt de l’attribut `num_eleve`.

*(bloc de réponse)*

...

**Réponse** L'attribut `num_eleve` permet de préserver l'unicité de chaque entité de la relation.

En effet, dans le modèle relationel une relation est un *ensemble* et dans un ensemble mathématique, chaque élément est unique.

Pour assurer cela, il faut définir cet attribut comme une **clé primaire**.

### 1.2
Écrire une requête SQL d’insertion permettant d’enregistrer l’élève `ACHIR Mussa` dans la table `seconde`. Les informations relatives à cet élève sont données dans la ligne 1 du fichier `seconde_lyc.csv`.

*(bloc de réponse)*

...

**Réponse**

    INSERT INTO seconde VALUES
        (133310, 'anglais', 'espagnol', '', '2A'),

In [ ]:
%%sql 
-- tester la requête sql ici;
-- ...

### 1.3

Lors de l’insertion de l’élève `ALTMEYER Yohan` (ligne 2 du fichier `seconde_lyc.csv`), une erreur de saisie a été commise sur la première langue, qui devrait être `allemand`. Écrire une requête SQL de mise à jour corrigeant les données de cet élève.

*(bloc de réponse)*

...

**Réponse**

    UPDATE seconde
        SET langue1 = 'allemand'
        WHERE num_eleve=156929;

In [ ]:
%%sql 
-- tester la requête sql ici;
-- ...

## Question 2

On suppose maintenant que la table `seconde` contient les informations issues de la figure 1 (ni plus, ni moins, même si la figure 1 n’est qu’un extrait du fichier `seconde_lyc.csv`).

### 2.1

Quel est le résultat de la requête ci-dessous ?

    SELECT num_eleve FROM seconde ;

*(bloc de réponse)*

...

In [ ]:
%%sql 
-- tester la requête sql ici;
-- ...

**Réponse** Cette requête affiche la liste de tous les identifiants de la relation `seconde`. Il y aura normalement 25 réponses.

In [43]:
%%sql
SELECT num_eleve FROM seconde;

 * sqlite://
Done.

[(24810,),
 (26454,),
 (26946,),
 (57934,),
 (75421,),
 (76725,),
 (81282,),
 (90689,),
 (94002,),
 (108303,),
 (121001,),
 (133310,),
 (156929,),
 (193514,),
 (249992,),
 (309341,),
 (321188,),
 (321262,),
 (488697,),
 (492698,),
 (500633,),
 (571113,),
 (815183,),
 (911887,)]

### 2.2

On rappelle qu’en SQL, la fonction d’agrégation `COUNT()` permet de compter le nombre d’enregistrements dans une table.
Quel est le résultat de la requête ci-dessous ?


    SELECT COUNT(num_eleve) FROM seconde ;

*(bloc de réponse)*

...

**Réponse** Cette requête compte le nombre d'élément possédant un valeur `num_eleve` et l'affiche. On obtient ainsi le nombre d'entités contenues dans la relation `seconde`. C'est donc le nombre total d'élèves qui s'affiche : `25`.

In [45]:
%%sql
SELECT COUNT(num_eleve) FROM seconde;

 * sqlite://
Done.

[(24,)]

### 2.3

Écrire la requête permettant de connaître le nombre d’élèves qui font `allemand` en `langue1` ou `langue2`.

*(bloc de réponse)*

...

In [ ]:
%%sql 
-- tester la requête sql ici;
-- ...

**Réponse**

    SELECT COUNT(num_eleve) FROM seconde
    WHERE langue1 = 'allemand' OR langue2 = 'allemand';

In [49]:
%%sql
SELECT COUNT(num_eleve) FROM seconde
WHERE langue1 = 'allemand' OR langue2 = 'allemand';

 * sqlite://
Done.

[(7,)]

## Question 3

Le chef d’établissement souhaite faire évoluer la structure de sa base de données. Pour ce faire, il créé une nouvelle table `eleve` dont la structure est la suivante :

![](./img-enonce03.png)

![](https://raw.githubusercontent.com/padilla-nsi/tnsi/main/cours/bases-de-donnees/3-requetesEtMiseAJour/img-enonce03.png)

In [52]:
%%sql

 * sqlite://
Done.
Done.

[]

In [57]:
%%sql
ALTER TABLE seconde 
    ADD FOREIGN KEY(num_eleve) REFERENCES eleve(num_eleve);

 * sqlite://
(sqlite3.OperationalError) near "FOREIGN": syntax error
[SQL: ALTER TABLE seconde ADD FOREIGN KEY(num_eleve) REFERENCES eleve(num_eleve);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

Là encore, l’attribut `num_eleve` est un entier, les autres sont des chaines de caractère (le type `CHAR`).

### 3.1

Expliquer ce qu’apporte l’information `clef étrangère` pour l’attribut `num_eleve` de cette table en termes d’intégrité et de cohérence.

*(bloc de réponse)*

...

**Réponse** La contrainte *clé étrangère* permet de faire référence à une clé primaire d'une autre table. C'est comme cela qu'on peut mettre en liens deux relations différentes.

### 3.2

On suppose la table `eleve` correctement créée et complétée. Le chef d’établissement aimerait lister les élèves (nom, prénom, date de naissance) de la classe 2A.

Écrire la commande qui permet d’établir cette liste à l’aide d’une jointure entre `eleve` et `seconde`.

*(bloc de réponse)*

...

In [ ]:
%%sql 
-- tester la requête sql ici;
-- ...

## Question 4

### 4

Proposer la structure d’une table `coordonnees` dans laquelle on pourra indiquer, pour chaque élève, son adresse, son code postal, sa ville, son adresse mail.

Préciser la clef primaire et/ou la clé étrangère en vue de la mise en relation avec les autres tables.

*(bloc de réponse)*

...

In [ ]:
%%sql 
-- tester la requête sql ici;
-- ...